Project/Toir/src/DataProcessors/ИнтеграцияС1СДокументооборот/ИнтеграцияС1СДокументооборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияС1СДокументооборот</name>
</mdclass:DataProcessor>

Project/Toir/src/Catalogs/ПравилаИнтеграцииС1СДокументооборотом/ПравилаИнтеграцииС1СДокументооборотом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаИнтеграцииС1СДокументооборотом</name>
  <attributes>
    <name>ТипОбъектаПотребителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаДокументооборота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайловСохраненияПечатныхФорм</name>
    <type>
      <types>EnumRef.ТипыФайловСохраненияПечатныхФормОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЗапрещаетИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПрименимостиПриВыгрузке</name>
    <comment>Выражение на встроенном языке, определяющее применимость правила при выгрузке в 1С:Документооборот</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПрименимостиПриЗагрузке</name>
    <comment>Выражение на встроенном языке, определяющее применимость правила при загрузке из 1С:Документооборота</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаПотребителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаДокументооборота</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьСвязиПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаЗаполненияРеквизитовПриВыгрузке</name>
    <attributes>
      <name>ИмяРеквизитаОбъектаДокументооборота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПравилаЗаполненияРеквизитов</name>
      <type>
        <types>EnumRef.ВариантыПравилЗаполненияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаПотребителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаДокументооборота</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗначенияРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычисляемоеВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъектаСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненВШаблоне</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключевой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаЗаполненияРеквизитовПриЗагрузке</name>
    <attributes>
      <name>ИмяРеквизитаОбъектаПотребителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПравилаЗаполненияРеквизитов</name>
      <type>
        <types>EnumRef.ВариантыПравилЗаполненияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаДокументооборота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаПотребителя</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычисляемоеВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъектаСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключевой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимИзмененияДанныхПроведенногоДокумента</name>
      <type>
        <types>EnumRef.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединяемыеПечатныеФормы</name>
    <attributes>
      <name>МенеджерПечати</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/ИнтеграцияС1СДокументооборот/Forms/ВыборТипаПредмета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ДеревоВариантов");
	
	// Самостоятельные типы предметов.
	ДобавитьСтроку(Дерево, "ФайлСДиска", НСтр("es='El fichero del disco';ru='Файл с диска';en='File from disk'"));
	
	// Предметы в ИС.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТипОбъектаПотребителя КАК ТипОбъекта,
		|	ВЫРАЗИТЬ(ПредставлениеОбъектаПотребителя КАК СТРОКА(100)) КАК Вариант,
		|	Правила.Ссылка КАК Правило,
		|	КлючевыеРеквизиты.ИмяРеквизитаОбъектаПотребителя КАК КлючОтбора,
		|	КлючевыеРеквизиты.ЗначениеРеквизитаПотребителя КАК ЗначениеОтбора
		|ИЗ
		|	Справочник.ПравилаИнтеграцииС1СДокументооборотом КАК Правила
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаИнтеграцииС1СДокументооборотом.ПравилаЗаполненияРеквизитовПриЗагрузке КАК КлючевыеРеквизиты
		|ПО Правила.Ссылка = КлючевыеРеквизиты.Ссылка И КлючевыеРеквизиты.Ключевой И Не КлючевыеРеквизиты.ДополнительныйРеквизитОбъекта
		|ГДЕ
		|	НЕ ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Вариант
		|ИТОГИ ПО
		|	Правило
		|");
	ВыборкаПравила = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаПравила.Количество() <> 0 Тогда
		НаименованиеИС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='EN %1';ru='В %1';en='In 1'"),
			ИнтеграцияС1СДокументооборот.СокращенноеНаименованиеКонфигурации());
		ЗаголовокИС = ДобавитьЗаголовок(Дерево, НаименованиеИС);
		Пока ВыборкаПравила.Следующий() Цикл
			Отбор = Новый СписокЗначений;
			ВыборкаКлючевыеРеквизиты = ВыборкаПравила.Выбрать();
			Пока ВыборкаКлючевыеРеквизиты.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаКлючевыеРеквизиты.КлючОтбора) Тогда
					Отбор.Добавить(ВыборкаКлючевыеРеквизиты.ЗначениеОтбора, ВыборкаКлючевыеРеквизиты.КлючОтбора);
				КонецЕсли;
			КонецЦикла;
			ДобавитьСтроку(ЗаголовокИС, ВыборкаПравила.ТипОбъекта, ВыборкаПравила.Вариант, Отбор);
		КонецЦикла;
	КонецЕсли;
	
	// Предметы в ДО.
	ЗаголовокДО = ДобавитьЗаголовок(Дерево, НСтр("es='En 1С:Документообороте';ru='В 1С:Документообороте';en='In 1С:Документообороте'"));
	ДобавитьСтроку(ЗаголовокДО, "DMFile", НСтр("es='El fichero';ru='Файл';en='File'"));
	ДобавитьСтроку(ЗаголовокДО, "DMInternalDocument", НСтр("es='El documento interior';ru='Внутренний документ';en='Internal document'"));
	ДобавитьСтроку(ЗаголовокДО, "DMIncomingDocument", НСтр("es='El documento recibido';ru='Входящий документ';en='Incoming document'"));
	ДобавитьСтроку(ЗаголовокДО, "DMOutgoingDocument", НСтр("es='El documento saliente';ru='Исходящий документ';en='Outgoing document'"));
	ДобавитьСтроку(ЗаголовокДО, "DMProject", НСтр("es='El proyecto';ru='Проект';en='Project'"));
	Если ИнтеграцияС1СДокументооборотПовтИсп.ИспользоватьТерминКорреспонденты() Тогда
		ДобавитьСтроку(ЗаголовокДО, "DMCorrespondent", НСтр("es='El corresponsal';ru='Корреспондент';en='Correspondent'"));
	Иначе
		ДобавитьСтроку(ЗаголовокДО, "DMCorrespondent", НСтр("es='El contratante';ru='Контрагент';en='Counterparty'"));
	КонецЕсли;
	
	ЗначениеВДанныеФормы(Дерево, ДеревоВариантов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ВыбратьВариант();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоВариантовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьВариант();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьВариант()
	
	ТекущиеДанные = Элементы.ДеревоВариантов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ЭтоЗаголовок Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Вариант", ТекущиеДанные.Вариант);
	Результат.Вставить("Отбор", ТекущиеДанные.Отбор);
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтроку(Дерево, Вариант, Представление, Отбор = Неопределено)
	
	Строка = Дерево.Строки.Добавить();
	Строка.Вариант = Вариант;
	Строка.Представление = Представление;
	Строка.Отбор = Отбор;
	
	Возврат Строка;
	
КонецФункции

&НаСервере
Функция ДобавитьЗаголовок(Дерево, Представление)
	
	Строка = Дерево.Строки.Добавить();
	Строка.Представление = Строка(Представление);
	Строка.ЭтоЗаголовок = Истина;
	
	Возврат Строка;
	
КонецФункции

#КонецОбласти
